{
    "nav": {
        "home": "Home",
        "about": "About",
        "portfolio": "Portfolio",
        "language": "Language"
    },
    "about": {
        "role": "product designer & developer",
        "bio": "an innovative product designer and developer based in london.",
        "viewPortfolio": "view portfolio",
        "experience": "experience",
        "education": "education",
        "skills": "skills"
    },
    "project_p": {
        "header": {
            "title": "ORA Web",
            "date": "December 6th, 2025",
            "download": "Download PDF",
            "copy": "Copy URL",
            "copied": "Successfully copied to clipboard"
        },
        "intro": {
            "title": "INTRO",
            "content": "The project is defined as ORA Web, a small-scale software system for a contract manufacturing company, focusing on integrating contract production data management and efficiency."
        },
        "team": {
            "title": "TEAM & MY ROLE",
            "client": "Client",
            "clientDesc": "Ora Nutrition Ltd (contract-manufacturing factory).",
            "clientPoints": [
                "Founded in 2019, scaled into one of the leading nutrition contract manufacturers in Auckland.",
                "Acquired in 2025 by a China-listed company."
            ],
            "context": "The factory has no in-house design team, so I operated as the <strong>sole designer</strong> in cross-functional delivery.",
            "role": "My Role",
            "roleDesc": "UX Designer (Solo)",
            "rolePoints": [
                "Led end-to-end UX for ORA Web, from problem framing to workflow design and system structure.",
                "Mapped contract-to-shipment processes and translated operational logic into scalable data and UI models.",
                "Facilitated alignment across Finance, Production Planning, Warehouse/Procurement, and Management.",
                "Worked closely with engineering to ensure feasibility and consistent status logic across views."
            ],
            "duration": "Project Duration",
            "durationDesc": "Case study scope: Jul 2023 – Aug 2024 · Ongoing"
        },
        "scope": {
            "title": "System Scope",
            "content": "This system spans three operational layers across the contract-to-production lifecycle:",
            "points": [
                "<strong>Decision Makers:</strong> They read and consolidated data for timing, risk, and client decisions.",
                "<strong>Shift/Planning Managers:</strong> They need accurate status and capacity signals to allocate work.",
                "<strong>Operators/Executors:</strong> They need structured input and clear next-step prompts to keep data reliable."
            ],
            "read": "Read: Decide timing and client priorities.",
            "readDesc": "Decide timing and client priorities.",
            "plan": "Plan: Connect orders to capacity.",
            "planDesc": "Connect orders to capacity.",
            "input": "Input: Heavy data entry & initial validation.",
            "inputDesc": "Heavy data entry & initial validation."
        },
        "rationale": {
            "title": "Project Rationale",
            "subtitle": "Enhancing Efficiency",
            "quote": "We connect contract-to-shipment data.\nSo managers stop wasting time on Excel checks."
        },
        "research": {
            "title": "Research Findings",
            "subtitle1": "Research Approach and Key Findings",
            "content1": "Instead of jumping straight into generic interviews, I started with quantitative analysis of how the shared Excel file was actually used. By logging user operations, I found that around <strong>54%</strong> of actions were pure data input and <strong>37%</strong> were just formatting changes—often used as reminders or unit conversions.",
            "stakeholders": {
                "title": "Who are the Users Behind the Data?",
                "description": "To understand the \"why\" behind the manual formatting behaviors, I mapped the stakeholders into three engagement layers. This helped me identify exactly who was struggling with what.",
                "graph_title": "Mapping the Humans Behind the Data",
                "graph_subtitle": "Categorizing stakeholders by their primary interaction with the system.",
                "groups": [
                    {
                        "layer_name": "Read Layer",
                        "name": "Decision Makers",
                        "role_title": "Directors & Procurement",
                        "subgroups": [
                            {
                                "names": "Wang",
                                "title": "The Factory Manager"
                            },
                            {
                                "names": "Lilian",
                                "title": "The Packaging Coordinator"
                            }
                        ],
                        "tags": [
                            "read",
                            "plan"
                        ],
                        "context": "High-level oversight & pattern recognition."
                    },
                    {
                        "layer_name": "Plan Layer",
                        "name": "Shift Managers",
                        "role_title": "Production & Reporting",
                        "subgroups": [
                            {
                                "names": "Flora",
                                "title": "The Production Supervisor"
                            },
                            {
                                "names": "Ethan",
                                "title": "The Production Planner"
                            }
                        ],
                        "tags": [
                            "plan"
                        ],
                        "context": "Connecting dots between orders and capacity."
                    },
                    {
                        "layer_name": "Input Layer",
                        "name": "Operators",
                        "role_title": "Admins & Receivers",
                        "subgroups": [
                            {
                                "names": "Nancy",
                                "title": "The Contract Receiver"
                            },
                            {
                                "names": "Cleo",
                                "title": "The Contract Manager"
                            }
                        ],
                        "tags": [
                            "input"
                        ],
                        "context": "Heavy data entry & initial validation."
                    }
                ]
            },
            "user_voice": {
                "title": "From Data to User Voice",
                "description": "While the quantitative data revealed what was happening (heavy manual entry), I needed to understand the why. I traced these patterns back to the specific users to uncover the root friction behind the numbers.",
                "quotes": [
                    {
                        "text": "We spend hours analyzing rows just to get a 'vague feeling' of whether we have the capacity to negotiate more orders.",
                        "role": "Wang, The Factory Manager",
                        "tags": [
                            "read"
                        ]
                    },
                    {
                        "text": "I’m juggling design, ordering, and clients every day. I simply don't have time to manually fix spreadsheet formatting.",
                        "role": "Lilian, The Packaging Coordinator",
                        "tags": [
                            "read"
                        ]
                    },
                    {
                        "text": "I need to add notes when things change, but I’m afraid to break the Excel formulas if I insert a new row.",
                        "role": "Flora, The Production Supervisor",
                        "tags": [
                            "plan"
                        ]
                    },
                    {
                        "text": "It would be a game-changer if the data was linked—so I know instantly when materials or packaging actually arrive.",
                        "role": "Ethan, The Production Planner",
                        "tags": [
                            "plan"
                        ]
                    },
                    {
                        "text": "I constantly switch between different sheets just to verify if the information is actually correct.",
                        "role": "Cleo, The Contract Manager",
                        "tags": [
                            "input"
                        ]
                    }
                ]
            }
        },
        "design_moves": {
            "title": "Turning these pain points into three core design moves.",
            "tabs": [
                {
                    "id": "link",
                    "title": "01. Link the Data",
                    "subtitle": "Structure the Input"
                },
                {
                    "id": "unify",
                    "title": "02. Unify the View",
                    "subtitle": "Filter the Noise"
                },
                {
                    "id": "reveal",
                    "title": "03. Reveal Capacity",
                    "subtitle": "Support Decisions"
                }
            ],
            "moves": [
                {
                    "id": "link",
                    "headline": "From Free-form to Guided Flow",
                    "context": {
                        "pain": "Operators often added rows randomly in Excel, breaking formulas and creating \"orphan data\" that didn't match the contract.",
                        "strategy": "I designed a linear flow: Contract → Schedule → Report. Users can now only report production on tasks that actually exist.",
                        "scope": [
                            "input",
                            "plan"
                        ]
                    },
                    "image": {
                        "alt": "Production Table",
                        "annotation": "Tasks are linked to contracts. No more random manual entry."
                    }
                },
                {
                    "id": "unify",
                    "headline": "One Master Table, Four Lenses",
                    "context": {
                        "pain": "Teams (Finance, Packing, Planning) wasted time switching between different spreadsheets just to find \"their\" columns.",
                        "strategy": "A Single Source of Truth with role-based tabs. Everyone works on the same live data, but sees a filtered view tailored to their job (e.g., Finance only sees payment status).",
                        "scope": [
                            "plan",
                            "read"
                        ]
                    },
                    "image": {
                        "alt": "Contract Table",
                        "annotation": "One click to filter irrelevant data."
                    }
                },
                {
                    "id": "reveal",
                    "headline": "Answers, Not Just Rows",
                    "context": {
                        "pain": "Managers relied on \"gut feelings\" to accept new orders because calculating actual capacity from raw rows took too long.",
                        "strategy": "Transformed the dashboard from a data list into a Decision Tool. It visualizes future capacity and bottlenecks, giving an instant \"Yes/No\" on whether to take new orders.",
                        "scope": [
                            "read"
                        ]
                    },
                    "image": {
                        "alt": "Dashboard Demo",
                        "annotation": "Visualizing free slots to help negotiate new orders."
                    }
                }
            ]
        },
        "choices": {
            "title": "Key Design Choices",
            "subtitle": ""
        },
        "excellence": {
            "title": "Unified Experience",
            "subtitle": "Dashboard and Business Impact",
            "section1": {
                "title": "From data to decisions: Internal Exception Radar & Process Lead Time",
                "content": "To take this project’s design solution integrate in user’s daily workflow, I extended the solution into an internal decision-support dashboard. Instead of repeating raw tables, the dashboard focuses on where time is lost and where processes break.",
                "list": [
                    "<strong>The Internal Exception Radar (P1-A)</strong> aggregates contract data and flags three key risk types: lead-time breach, payment blocked and material risk.",
                    "<strong>The Key Contracts Stage Overview (P1-B)</strong> then shows which specific contracts are affected and at which internal stage they are stuck. In our analysis, for example, around 68% of delays were linked to material readiness and 45% to production exceeding internal targets, giving management a clear view of the main bottlenecks without digging through spreadsheets.",
                    "<strong>The Process Lead Time view (P2)</strong> visualises how long contracts spend in each stage, and whether we are meeting or exceeding our own SLA targets."
                ],
                "content2": "What differentiates this dashboard is that it does not try to show everything. It deliberately moves away from raw, dense data and focuses on:",
                "points": [
                    "Where we are losing time",
                    "Which processes are failing",
                    "Which contracts are impacted and need attention"
                ],
                "content3": "This makes it useful for decision-makers who need immediate, actionable signals, not just a static report."
            },
            "section2": {
                "title": "Working with the “messy reality” of stakeholder feedback",
                "content": "When I first shared the dashboard prototype, it was intentionally simple: a few focused widgets and a clear story about bottlenecks. That early version quickly triggered a wave of stakeholder responses, such as:",
                "list": [
                    "Requests for discrepancy alerts between planned vs. actual timelines.",
                    "Interest in trend analysis over time, not just a snapshot.",
                    "Comments like: “This data would help me a lot when I talk to our clients.”"
                ],
                "content2": "I chose to include this “messy middle” in my case study because it shows what actually happens after a first design goes live: priorities shift, new expectations surface, and the scope grows.",
                "content3": "Instead of treating this as a failure of planning, I used it as a chance to:",
                "points": [
                    "Re-prioritize features with stakeholders.",
                    "Clarify which insights are “must-have now” vs. “good to have later”.",
                    "Refine the dashboard so it could support both internal operations and client-facing conversations."
                ],
                "content4": "This part of the story demonstrates my ability to work through ambiguity, respond to evolving needs, and keep the design grounded in what the business really cares about."
            }
        },
        "reflection": {
            "title": "Reflection",
            "subtitle": "Using the Kano Model",
            "content": "In my reflection, I used the <strong>Kano model</strong> to make sense of the different types of dashboard features:",
            "list": [
                "<strong>Basic expectations:</strong> E.g. being able to see contract status and lead time without digging through spreadsheets.",
                "<strong>Performance features:</strong> Clearer bottleneck visualization that directly improves planning and internal coordination.",
                "<strong>Delighters:</strong> For example, exception alerts and narrative views that help managers explain issues to clients."
            ],
            "content2": "By mapping stakeholder requests and existing widgets onto the Kano model, I could:",
            "points": [
                "Distinguish between \"must not fail\" basics and \"high-impact\" improvements.",
                "Avoid overloading the dashboard with nice-to-have charts that don’t change decisions.",
                "Show that I’m not only designing UI, but also prioritizing features systematically."
            ],
            "content3": "Including this reflection is my way of demonstrating a growth mindset: I’m willing to learn, borrow tools from product/strategy (like Kano), and use them to make more grounded design choices."
        }
    },
    "home": {
        "intro": {
            "name": "rongze xu",
            "subtitle": "product designer & developer",
            "statement": "rongze is an innovative product designer and developer based in london.",
            "viewPortfolio": "view portfolio"
        },
        "projects": {
            "heading": "projects",
            "p": {
                "title": "Ora Web",
                "description": "We increased factory management efficiency by integrating contract and production data into a simple ERP tool."
            },
            "one": {
                "title": "Innerpeace",
                "description": "We created a low-cost mental health app for students, optimized to run on affordable Android devices, enabling large-scale testing with a research database and delivering accessible stress-relief at scale."
            },
            "notification": {
                "title": "Vibe Coding in Progress 🚧",
                "description": "{{title}} is currently being updated."
            }
        }
    },
    "workloadGraph": {
        "title": "Workload Analysis",
        "dataEntry": "Data Entry",
        "dataEntryDesc": "Pure data input (typing numbers/dates)",
        "formatting": "Formatting",
        "formattingDesc": "Users used colors/borders to mark progress, flag blockers, and create reminders",
        "clearDelete": "Clear / Delete",
        "clearDeleteDesc": "Correcting errors or resetting cells"
    }
}